# Simple Linear regression

In [1]:
#Experiment no:-07

In [ ]:
#Aim:To perform Simple Linear Regression

In [ ]:
#Name:Ziya Firdos
#Roll no:68
#sec:3A
#Subjict:ET1
#Date:22/09/25

In [ ]:
import pandas as pd

In [2]:
import os

In [3]:
os.getcwd()

'C:\\Users\\USER'

In [7]:
os.chdir("C:\\Users\\USER\\Desktop")

In [8]:
data=pd.read_csv("Salary_Data.csv")

In [9]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [10]:
data.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [12]:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [14]:
data.size

60

In [15]:
data.shape

(30, 2)

In [16]:
data.infodata

<bound method DataFrame.info of     YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0>

In [17]:
data.ndim

2

In [18]:
data.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [19]:
data.mean()

YearsExperience        5.313333
Salary             76003.000000
dtype: float64

In [20]:
data.median()

YearsExperience        4.7
Salary             65237.0
dtype: float64

In [21]:
data.isnull()

    YearsExperience  Salary
0             False   False
1             False   False
2             False   False
3             False   False
4             False   False
5             False   False
6             False   False
7             False   False
8             False   False
9             False   False
10            False   False
11            False   False
12            False   False
13            False   False
14            False   False
15            False   False
16            False   False
17            False   False
18            False   False
19            False   False
20            False   False
21            False   False
22            False   False
23            False   False
24            False   False
25            False   False
26            False   False
27            False   False
28            False   False
29            False   False

In [22]:
data.sum()

YearsExperience        159.4
Salary             2280090.0
dtype: float64

# Independent and Dependent Variable

In [23]:
x=data.drop('Salary',axis=1)

In [24]:
x.head()

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2

In [27]:
y=data.Salary

In [28]:
y.head()

0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
Name: Salary, dtype: float64

In [ ]:
Conclusion :-Thus we perform an operation on Simple Linear regression by using Pandas.